INSERT INTO table_personal_informations (nickname, date_of_registration)
VALUES ('PixelMaster', '2024-01-15'),
       ('ScriptWizard', '2024-02-20'),
       ('VideoNinja', '2024-03-10'),
       ('SoundMage', '2024-04-05'),
       ('DesignFox', '2024-05-12');

INSERT INTO table_personal_data (number, series, issued_by, date_of_issue, department_code, last_name, first_name,
                                 patronymic, residential_address, personal_id)
VALUES ('1234 567890', '45 12', 'ОВД г. Воронеж', '2020-06-10', '123-456', 'Иванов', 'Алексей', 'Сергеевич',
        'Воронеж, ул. Ленина 15', 1),
       ('2345 678901', '56 23', 'ОВД г. Москва', '2021-07-20', '234-567', 'Петрова', 'Мария', 'Алексеевна',
        'Москва, пр. Мира 25', 2),
       ('3456 789012', '67 34', 'ОВД г. СПб', '2019-08-15', '345-678', 'Сидоров', 'Дмитрий', NULL, 'СПб, Невский 100',
        3),
       ('4567 890123', '78 45', 'ОВД г. Екатеринбург', '2022-09-01', '456-789', 'Козлова', 'Елена', 'Викторовна',
        'Екб, ул. Малышева 50', 4),
       ('5678 901234', '89 56', 'ОВД г. Новосибирск', '2020-10-25', '567-890', 'Смирнов', 'Николай', 'Петрович',
        'Новосиб, Красный 77', 5);


INSERT INTO table_projects (name, deadline)
VALUES ('Рекламный ролик AutoBrand', '2026-06-15'),
       ('Корпоративный сайт для банка', '2026-05-30'),
       ('Анимационный сериал "КосмоКоты"', '2026-08-20');


INSERT INTO table_project_activity (executor_id, project_id, roles)
VALUES (1, 1, 'Ведущий'),      
       (2, 1, 'Сценарист'),  
       (3, 1, 'Монтажёр'),     
       (3, 2, 'Монтажёр'),     
       (4, 2, 'Звукорежиссёр'),
       (1, 2, 'Дизайнер'),
       (5, 3, 'Художник'),   
       (2, 3, 'Сценарист'), 
       (4, 3, 'Звукорежиссёр'); 